{"title":"Events Suck; Let's Change That!","summary":"Yet another change for the better","date_published":"2021-07-03T01:05:50.622Z","authors":[{"name":"Leon","url":"https://other.respdev.com"},{"name":"Shane","url":"https://twitter.com/vandesm14"}],"id":"events-suck","content_html":"<p><em><strong>A quick note</strong>: We really wanted to get this out as quick as we could as it\nis a big update. Sorry for any mistakes you see or weird sentence structures,\nwe were just excited!</em></p>\n<h1>Update: First Monthly Theme!</h1>\n<p>You can find the event <a href=\"/blog/the-first-theme.md\">here</a>!</p>\n<h1>Out with the Old</h1>\n<p>So we've all seen the events, a friendly competition to create something in a\ngiven timeframe and possibly get voted 1st place by the community. <strong>Let's be\nhonest, they sucked, a lot</strong>. But why?</p>\n<h2>Boring Ideas</h2>\n<p>Not once did we have an event idea that sounded - fun. Every idea felt like a\nrun of the mill browser search for <em>fun projects to do in X language</em>. We want\nto change that, and so we will be asking <strong>you</strong> for <strong>your</strong> amazing ideas\nmore often.</p>\n<p>When you look at it, it's almost like we forgot that we were a community for\na second there, so let's fix that!</p>\n<h2>Not Everyone is Competitive</h2>\n<p>There are only really two reasons people compete in a challenge:</p>\n<ul>\n<li><strong>they're competitive</strong>,</li>\n<li>or <strong>there's something to be won</strong>.</li>\n</ul>\n<p><strong>Unfortunately, we're broke</strong>; the second option was never something we could\ndo even if we wanted to - <em>apart from the Nitro that one time</em>. And also <strong>most\npeople aren't the competitive type</strong>, so we need a better format than this.</p>\n<h2>Scheduling</h2>\n<p><strong>You</strong> have things to do, and so do we. <strong>A week is not long enough</strong> for\npeople to get a, <em>sometimes medium sized</em>, project done. This is especially\ntrue when said project <strong>doesn't excite you</strong> and is, for all intents and\npurposes, a <em>side project</em>.</p>\n<h2>Involvement</h2>\n<p><strong>Not many people got involved, and we don't blame you</strong>. The events were\nboring, never fit anyone's schedule, and didn't even have a reward (<em>like most\nevents!</em>). <strong>It's not on you that we didn't provide fun events, that's our\nproblem and we want to fix it...</strong></p>\n<h1>In with the New</h1>\n<p>So we've been thinking of a <strong>whole new system to fully replace events</strong> once\nthe <strong>Verselet x Responsive MiniGolf</strong> event finishes (<em>that one should\nactually be good fun for you competitive types</em>). Hopefully we can get it right\nthis time so that everyone has the most fun possible.</p>\n<h2>Monthly Themes</h2>\n<p><strong>Monthly themes</strong> is the new idea; we say <em>monthly</em> but this might change as\nwe learn more about how everyone interacts with them. How they work is that <strong>a\ntheme gets announced</strong> and <strong>you can decide if and when you want to give it a\ngo</strong>. You can <strong>give past themes a try</strong> if you want, it's up to you.</p>\n<p>The whole rationale is for it to act more like an <strong>idea to get you started\ninstead of constraints that ruin your creativity</strong>. You might make something big\nfrom the idea, a little example, or nothing at all; <strong>it's all up to you</strong>.</p>\n<h2>Sharing Your Projects</h2>\n<p>The great thing is that <strong>everyone can see what you've made</strong>, we'll be setting\nup a system for you to be able to add your project to the list! <strong>If we see\nsomething we really like we'll feature it in a blog post, or you may want to\nwrite your own blog post about it to be shared here</strong>!</p>\n<h2>A New Leaf</h2>\n<p>We hope that this time we can make something enjoyable for everyone. As always,\nyour feedback is greatly appreciated, feel free to <code>@Leonski</code> or <code>@TheDevBird</code>\nin the <strong>discord</strong> or email us at responsivedev@pm.me.</p>\n<p>Thanks for being such an amazing community!</p>\n"}