{"title":"The Other Site","summary":"And we just got a new look...","date_published":"2021-06-29T20:35:53.929Z","authors":[{"name":"Leon","url":"https://other.respdev.com/"}],"id":"the-other-site","content_html":"<h1>It's Alive!</h1>\n<p>So we just updated the website, you can find out more in our <a href=\"https://respdev.com/blog/first-post\">first-post</a>. The\nmain thing we got done since then has been fully scrapping the newsletter and\nswitching to a whole new blog system. I got to work on the backend whilst Shane\ngot it looking pretty (<em>and much more but I digress for the sake of comedy</em>).</p>\n<p>Since we just got done getting the base of it implemented, if you spot anything\nacting weird then please <a href=\"https://github.com/ResponsiveDev/main-site/issues/new\">open an issue</a> so that we can fix it, thanks!</p>\n<h1>Having Fun</h1>\n<p>Once we got the blog all up-and-running I decided, <em>as all up programmers love\nto do</em>, I want to make my version of the thing. In this case I'm on about the\nwebsite. Shane has put a lot of work into the site and has done amazing, but I\njust wanted to give it a go (<em>don't worry, this will still be the main site</em>).\nAnd so I did...</p>\n<h2>Making it Fun</h2>\n<p>Instead of using a framework, like <a href=\"https://kit.svelte.dev\">svelte-kit</a> which is what the main site\nuses, I wanted to do it the <em>good ol' fashion way</em>. This meant vanilla \nJavaScript, HTML, and CSS. The only extra thing I did use was <a href=\"https://www.typescriptlang.org\">TypeScript</a> as\nit helped catch a good amount of errors without me spending another day on\nthe project.</p>\n<p>When it came to the design, the new one that just released on the main site\nlooked good so I stuck with that, apart from a few key differences:</p>\n<h3>Grid</h3>\n<p>Grids are great when you use them right, and while I can't say I used them\nright, I did use them. These are what hold the foundation of the layout\ntogether. If you look at the main site compared with this one you'll set that\nit has much stricter content width, <code>80ch</code> to be exact.</p>\n<h3>Font</h3>\n<p>This is not so much about the font as it is about the typography decisions. I\nwent for a line height of <code>1.4</code> for content and <code>1.2</code> for headings. This allows\nthe content to breath and tay readable across devices. This along with the\n<code>80ch</code> makes is super easy to read for desktop to mobile.</p>\n<h3>Less Styling</h3>\n<p>While it sounds like I messed around with the styles a lot, I really didn't. I\nkept it as default as I could whilst still making it unique and pleasant to\nlook at.</p>\n<h3>Less Scripting</h3>\n<p>Just like with the styles, I kept the scripting to a minimum too. The only\nthing that actually uses and requires the use of it is the blog (<em>at the moment\nthat is</em>), so that's all I did.</p>\n<h2>Into the Code</h2>\n<p>If you take a look in the <a href=\"https://github.com/ResponsiveDev/leon-site\">repo</a>\nyou can pretty much figure out how I did everything. First came the HTML\nfiles with their bits of CSS, then I moved onto the blog which needed some\nJS/TS. That's really it, nothing crazy. I do recommend having a look around\nto see how it work, especially if you're a beginner, you might learn something\nnew.</p>\n<p>Since there's not much to talk about in regards to the actual code, I'll let\nit speak for itself. If you do have any questions then please feel free to ask\nme in the <strong>discord</strong> server, don't forget to ping me when you do (<code>@Leonski</code>).\nIf there's anything interesting that gets brought up I'll be sure to add it\nhere for others to see.</p>\n<h2>Conclusion</h2>\n<p>All-in-all it took me a few hours to get the site to where it is now, including\nthe few extra commits I pushed before writing this post. That's not too bad,\nalthough I did have full knowledge of how the blog worked as so on. Nonetheless,\nit was great fun and I even encourage you do give it a go with something you\nuse.</p>\n<p>You can find the website <a href=\"https://leon.respdev.com\">here</a>, and I'll continue to\nupdate it as the main site also updates.</p>\n<p>Have a great day and I'll see you in the next one!</p>\n"}